Merge pull request #26 from jayaprakashkaluva/computer-science
Added computer architecture notes
